---
kind: type
id: T:Autodesk.Revit.UI.ScrollbarVisibility
source: html/c5d6dd18-d4bf-1f83-77d7-286c2782b936.htm
---
# Autodesk.Revit.UI.ScrollbarVisibility

Lists all the visibility types of the scrollbar in the preview view.

## Syntax (C#)
```csharp
public enum ScrollbarVisibility
```